Revit 2024 API
SpaceType Enumeration
An enumerated type listing all the possible space types for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum SpaceType
Visual Basic
Public Enumeration SpaceType
Visual C++
public enum class SpaceType
Members
Member name | Description
NoSpaceType | Space Type is NoSpaceType.
kActiveStorage | Space Type is ActiveStorage.
kActiveStorageHospitalOrHealthcare | Space Type is ActiveStorageHospitalOrHealthcare.
kAirOrTrainOrBusBaggageArea | Space Type is AirOrTrainOrBusBaggageArea.
kAirportConcourse | Space Type is AirportConcourse.
kAtriumEachAdditionalFloor | Space Type is AtriumEachAdditionalFloor.
kAtriumFirstThreeFloors | Space Type is AtriumFirstThreeFloors.
kAudienceOrSeatingAreaPenitentiary | Space Type is AudienceOrSeatingAreaPenitentiary.
kAudienceOrSeatingAreaExerciseCenter | Space Type is AudienceOrSeatingAreaExerciseCenter.
kAudienceOrSeatingAreaGymnasium | Space Type is AudienceOrSeatingAreaGymnasium.
kAudienceOrSeatingAreaSportsArena | Space Type is AudienceOrSeatingAreaSportsArena.
kAudienceOrSeatingAreaConventionCenter | Space Type is AudienceOrSeatingAreaConventionCenter.
kAudienceOrSeatingAreaMotionPictureTheatre | Space Type is AudienceOrSeatingAreaMotionPictureTheatre.
kAudienceOrSeatingAreaPerformingArtsTheatre | Space Type is AudienceOrSeatingAreaPerformingArtsTheatre.
kAudienceOrSeatingAreaReligious | Space Type is AudienceOrSeatingAreaReligious.
kAudienceOrSeatingAreaPoliceOrFireStations | Space Type is AudienceOrSeatingAreaPoliceOrFireStations.
kAudienceOrSeatingAreaCourtHouse | Space Type is AudienceOrSeatingAreaCourtHouse.
kAudienceOrSeatingAreaAuditorium | Space Type is AudienceOrSeatingAreaAuditorium.
kBankCustomerArea | Space Type is BankCustomerArea.
kBankingActivityAreaOffice | Space Type is BankingActivityAreaOffice.
kBarberAndBeautyParlor | Space Type is BarberAndBeautyParlor.
kCardFileAndCataloguingLibrary | Space Type is CardFileAndCataloguingLibrary.
kClassroomOrLectureOrTrainingPenitentiary | Space Type is ClassroomOrLectureOrTrainingPenitentiary.
kClassroomOrLectureOrTraining | Space Type is ClassroomOrLectureOrTraining.
kConfinementCellsPenitentiary | Space Type is ConfinementCellsPenitentiary.
kConfinementCellsCourtHouse | Space Type is ConfinementCellsCourtHouse.
kConferenceMeetingOrMultipurpose | Space Type is ConferenceMeetingOrMultipurpose.
kCorridorOrTransition | Space Type is CorridorOrTransition.
kCorridorOrTransitionManufacturingFacility | Space Type is CorridorOrTransitionManufacturingFacility.
kCorridorsWithPatientWaitingExamHospitalOrHealthcare | Space Type is CorridorsWithPatientWaitingExamHospitalOrHealthcare.
kCourtSportsAreaSportsArena | Space Type is CourtSportsAreaSportsArena.
kCourtroomCourtHouse | Space Type is CourtroomCourtHouse.
kDepartmentStoreSalesAreaRetail | Space Type is DepartmentStoreSalesAreaRetail.
kDetailedManufacturingFacility | Space Type is DetailedManufacturingFacility.
kDiningArea | Space Type is DiningArea.
kDiningAreaHotel | Space Type is DiningAreaHotel.
kDiningAreaFamilyDining | Space Type is DiningAreaFamilyDining.
kDiningAreaLoungeOrLeisureDining | Space Type is DiningAreaLoungeOrLeisureDining.
kDiningAreaMotel | Space Type is DiningAreaMotel.
kDiningAreaTransportation | Space Type is DiningAreaTransportation.
kDiningAreaPenitentiary | Space Type is DiningAreaPenitentiary.
kDiningAreaCivilServices | Space Type is DiningAreaCivilServices.
kDormitoryBedroom | Space Type is DormitoryBedroom.
kDormitoryStudyHall | Space Type is DormitoryStudyHall.
kDressingOrLockerOrFittingRoomGymnasium | Space Type is DressingOrLockerOrFittingRoomGymnasium.
kDressingOrLockerOrFittingRoomCourtHouse | Space Type is DressingOrLockerOrFittingRoomCourtHouse.
kDressingOrLockerOrFittingRoomPerformingArtsTheatre | Space Type is DressingOrLockerOrFittingRoomPerformingArtsTheatre.
kDressingOrLockerOrFittingRoomAuditorium | Space Type is DressingOrLockerOrFittingRoomAuditorium.
kDressingOrLockerOrFittingRoomExerciseCenter | Space Type is DressingOrLockerOrFittingRoomExerciseCenter.
kElectricalOrMechanical | Space Type is ElectricalOrMechanical.
kElevatorLobbies | Space Type is ElevatorLobbies.
kEmergencyHospitalOrHealthcare | Space Type is EmergencyHospitalOrHealthcare.
kEquipmentRoomManufacturingFacility | Space Type is EquipmentRoomManufacturingFacility.
kExamOrTreatmentHospitalOrHealthcare | Space Type is ExamOrTreatmentHospitalOrHealthcare.
kExerciseAreaExerciseCenter | Space Type is ExerciseAreaExerciseCenter.
kExerciseAreaGymnasium | Space Type is ExerciseAreaGymnasium.
kExhibitSpaceConventionCenter | Space Type is ExhibitSpaceConventionCenter.
kFellowshipHallReligiousBuildings | Space Type is FellowshipHallReligiousBuildings.
kFineMaterialWarehouse | Space Type is FineMaterialWarehouse.
kFineMerchandiseSalesAreaRetail | Space Type is FineMerchandiseSalesAreaRetail.
kFireStationEngineRoomPoliceOrFireStation | Space Type is FireStationEngineRoomPoliceOrFireStation.
kFoodPreparation | Space Type is FoodPreparation.
kGarageServiceOrRepairAutomotiveFacility | Space Type is GarageServiceOrRepairAutomotiveFacility.
kGeneralHighBayManufacturingFacility | Space Type is GeneralHighBayManufacturingFacility.
kGeneralLowBayManufacturingFacility | Space Type is GeneralLowBayManufacturingFacility.
kGeneralExhibitionMuseum | Space Type is GeneralExhibitionMuseum.
kHospitalNurseryHospitalOrHealthcare | Space Type is HospitalNurseryHospitalOrHealthcare.
kHospitalOrMedicalSuppliesHospitalOrHealthcare | Space Type is HospitalOrMedicalSuppliesHospitalOrHealthcare.
kHospitalOrRadiologyHospitalOrHealthcare | Space Type is HospitalOrRadiologyHospitalOrHealthcare.
kHotelOrConferenceCenterConferenceOrMeeting | Space Type is HotelOrConferenceCenterConferenceOrMeeting.
kInactiveStorage | Space Type is InactiveStorage.
kJudgesChambersCourtHouse | Space Type is JudgesChambersCourtHouse.
kLaboratoryOffice | Space Type is LaboratoryOffice.
kLaundryIroningAndSorting | Space Type is LaundryIroningAndSorting.
kLaundryWashingHospitalOrHealthcare | Space Type is LaundryWashingHospitalOrHealthcare.
kLibraryAudioVisualLibraryAudioVisual | Space Type is LibraryAudioVisualLibraryAudioVisual.
kLivingQuartersDormitory | Space Type is LivingQuartersDormitory.
kLivingQuartersMotel | Space Type is LivingQuartersMotel.
kLivingQuartersHotel | Space Type is LivingQuartersHotel.
kLobby | Space Type is Lobby.
kLobbyReligiousBuildings | Space Type is LobbyReligiousBuildings.
kLobbyMotionPictureTheatre | Space Type is LobbyMotionPictureTheatre.
kLobbyAuditorium | Space Type is LobbyAuditorium.
kLobbyPerformingArtsTheatre | Space Type is LobbyPerformingArtsTheatre.
kLobbyPostOffice | Space Type is LobbyPostOffice.
kLobbyHotel | Space Type is LobbyHotel.
kLoungeOrRecreation | Space Type is LoungeOrRecreation.
kMallConcourseSalesAreaRetail | Space Type is MallConcourseSalesAreaRetail.
kMassMerchandisingSalesAreaRetail | Space Type is MassMerchandisingSalesAreaRetail.
kMediumOrBulkyMaterialWarehouse | Space Type is MediumOrBulkyMaterialWarehouse.
kMerchandisingSalesAreaRetail | Space Type is MerchandisingSalesAreaRetail.
kMuseumAndGalleryStorage | Space Type is MuseumAndGalleryStorage.
kNurseStationHospitalOrHealthcare | Space Type is NurseStationHospitalOrHealthcare.
kOfficeEnclosed | Space Type is OfficeEnclosed.
kOfficeOpenPlan | Space Type is OfficeOpenPlan.
kOfficeCommonActivityAreasInactiveStorage | Space Type is OfficeCommonActivityAreasInactiveStorage.
kOperatingRoomHospitalOrHealthcare | Space Type is OperatingRoomHospitalOrHealthcare.
kOtherTelevisedPlayingAreaSportsArena | Space Type is OtherTelevisedPlayingAreaSportsArena.
kParkingAreaAttendantOnlyParkingGarage | Space Type is ParkingAreaAttendantOnlyParkingGarage.
kParkingAreaPedestrianParkingGarage | Space Type is ParkingAreaPedestrianParkingGarage.
kPatientRoomHospitalOrHealthcare | Space Type is PatientRoomHospitalOrHealthcare.
kPersonalServicesSalesAreaRetail | Space Type is PersonalServicesSalesAreaRetail.
kPharmacyHospitalOrHealthcare | Space Type is PharmacyHospitalOrHealthcare.
kPhysicalTherapyHospitalOrHealthcare | Space Type is PhysicalTherapyHospitalOrHealthcare.
kPlayingAreaGymnasium | Space Type is PlayingAreaGymnasium.
kPlenum | Space Type is Plenum.
kPoliceStationLaboratoryPoliceOrFireStations | Space Type is PoliceStationLaboratoryPoliceOrFireStations.
kPublicAndStaffLoungeHospitalOrHealthcare | Space Type is PublicAndStaffLoungeHospitalOrHealthcare.
kReadingAreaLibrary | Space Type is ReadingAreaLibrary.
kReceptionOrWaitingTransportation | Space Type is ReceptionOrWaitingTransportation.
kReceptionOrWaitingMotel | Space Type is ReceptionOrWaitingMotel.
kReceptionOrWaitingHotel | Space Type is ReceptionOrWaitingHotel.
kRecoveryHospitalOrHealthcare | Space Type is RecoveryHospitalOrHealthcare.
kRestorationMuseum | Space Type is RestorationMuseum.
kRestrooms | Space Type is Restrooms.
kRingSportsAreaSportsArena | Space Type is RingSportsAreaSportsArena.
kSleepingQuartersPoliceOrFireStation | Space Type is SleepingQuartersPoliceOrFireStation.
kSortingAreaPostOffice | Space Type is SortingAreaPostOffice.
kSpecialtyStoreSalesAreaRetail | Space Type is SpecialtyStoreSalesAreaRetail.
kStacksLibrary | Space Type is StacksLibrary.
kStairsInactive | Space Type is StairsInactive.
kStairway | Space Type is Stairway.
kSupermarketSalesAreaRetail | Space Type is SupermarketSalesAreaRetail.
kTerminalTicketCounterTransportation | Space Type is TerminalTicketCounterTransportation.
kWorkshopWorkshop | Space Type is WorkshopWorkshop.
kWorshipPulpitChoirReligious | Space Type is WorshipPulpitChoirReligious.
kNoOfSpaceTypes | Space Type is NoOfSpaceTypes.
See Also
Autodesk.Revit.DB.Mechanical Namespace